Feature: Проверка полей для ввода
  Scenario: Проверка возможности ввода корректных в инпутах
    Given Открыл интерфейс
    When Выбираю основание "<base1>" и ввожу число "<value1>" для 1 числа
    And Дописываю символ "<symbol>"
    Then Конечный текст получается "<result>"
  
  Examples:
    | base1 | value1 | symbol | result |
    | 10 | 10 | 1 | 101 | 
    | 10 | 10 | A | 10 |
    | 2 | 0 | 1 | 1 |
    | 2 | 101 | 4 | 101 |
    | 2 | 1010 | 0 | 10100 |
    | 16 | 1A6 | C | 1A6C |
    | 16 | 1A6 | 3 | 1A63 |
    | 16 | 1A6 | G | 1A6 |

